Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེ་ཐོབ་པར་གྱུར་མ་ཐག་ཏུ་དེས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་ཚད་མེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མཐོང་བར་གྱུར་ཏོ། །
en: As soon as she attained that, she saw the countless tathāgatas present within the world realms in the ten directions.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསྐལ་པ་ཚད་མེད་པར་དམྱིགས་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བས་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་སྟོན་པ་འདི་ལའང་ཤིན་ཏུ་ཕྲ་བའི་ཚུལ་གྱིས་ཞུགས་པར་གྱུར་ཏེ།
en: She entered in a subtle way this bodhisattva liberation called the miraculous manifestations at the birth of bodhisattvas throughout all the perceptions of countless kalpas.

source: དེ་ནི་དཔེར་ན། མའི་མངལ་དུ་ཞུགས་མ་ཐག་པའི་རྣམ་པར་ཤེས་པ་ལྟ་བུའོ། །
en: This was like the moment when a consciousness enters a womb.

source: རྣམ་པར་ཐར་པ་དེ་ཐོབ་པར་གྱུར་པས་ཀྱང་། དེས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ། ཡང་དག་པར་བལྟ་བའི་སྨོན་ལམ་ཆེན་པོ་ཡང་མངོན་པར་བསྒྲུབས་སོ། །
en: Through attaining that liberation, she made the great prayer to see the miraculous manifestations at the births of all tathāgatas.

source: དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའི་མ་མ་དྲི་མ་མེད་པས་བསྐྱེད་པའི་འོད་ཅེས་བྱ་བ་བྱུང་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: If you think that the bodhisattva’s nurse, Vimala­saṃbhava­prabhā, at that time, in that time, was anyone else, do not see her in that way.

source: ཁོ་མོ་ནི་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའི་མ་མ་དྲི་མ་མེད་པ་སྐྱེད་པའི་འོད་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: I was at that time, in that time, the bodhisattva’s nurse, Vimala­saṃbhava­prabhā.

source: དེའི་ཚེ་དེའི་དུས་ན་བུད་མྱེད་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་ཉི་ཤུ་བྱུང་བར་གྱུར་པ་དེ་དག་གཞན་དག་ཅིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ཡང་དེ་ལྟར་མི་བལྟ་སྟེ།
en: If you think that the two hundred thousand trillion women at that time, in that time, were anyone else, do not see them in that way.

source: ལྷ་མོ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་ཉི་ཤུ་པོ་ལུམ་བི་ནིའི་ནགས་ཚལ་ན་གནས་པ་ཁོ་མོའི་འཁོར་དུ་གྱུར་པ་འདི་དག་ཡིན་ནོ། །
en: They are these two hundred thousand trillion goddesses who now dwell in the Lumbinī Forest and are my entourage.

source: དེའི་ཚེ་དེའི་དུས་ན་དབང་ཕྱུག་གི་ཡོན་ཏན་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་གཞོན་ནུའི་ཡུམ་རབ་ཏུ་དགའ་བའི་འོད་ལ་དབང་བསྒྱུར་བ་ཞེས་བྱ་བ་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ནའང་དེ་ལྟར་མི་བལྟ་སྟེ།
en: If you think that Queen Suharṣita­prabheśvarā, the mother of the Tathāgata Īśvara­guṇāparājita­dhvaja, at that time, in that time, was anyone else, do not see her in that way.

source: ལྷ་མོ་སྒྱུ་མ་འདི་ནི་དེའི་ཚེ་དེའི་དུས་ན་རབ་ཏུ་དགའ་བའི་འོད་ལ་དབང་བསྒྱུར་བ་ཞེས་བྱ་བའི་ལྷ་མོར་གྱུར་ཏོ། །
en: This Māyādevī was at that time, in that time, the queen named Suharṣita­prabheśvarā.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་རིན་པོ་ཆེའི་འོད་འཕྲོ་བའི་མྱིག་གི་འོད་ཅེས་བྱ་བ་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ཡང་དེ་ལྟར་མི་བལྟ་སྟེ།
en: If you think that King Ratnārci­netra­prabha at that time, in that time, was anyone else, do not see him in that way.

source: རྒྱལ་པོ་ཟས་གཙང་མ་འདི་ནི་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་རིན་པོ་ཆེ་འོད་འཕྲོ་བའི་མྱིག་གི་འོད་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: King Śuddhodana was at that time, in that time, the king named Ratnārci­netra­prabha.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་ནི་དེ་ཕྱིན་ཅད་དུ་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་ལ་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་པ་དང་། སེམས་ཅན་རྣམ་པར་འདུལ་བའི་ཁྱུ་མཆོག་གི་མཐུས་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་ལ་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་པ་དང་། སྐད་ཅིག་ཐམས་ཅད་དུ་བྲལ་བར་མ་གྱུར་ཏོ། །
en: “Noble one, since that time, in every instant I have never been apart from seeing and comprehending the ocean of miraculous manifestations at the bodhisattva births of the Bhagavat Vairocana or from seeing and comprehending the ocean of the miraculous manifestations of his supremacy in guiding beings.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྨོན་ལམ་རྒྱ་མཚོ་འབྱམ་ཀླས་པ་ལས་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་མཚོ་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཐམས་ཅད་ན་ཡོད་པ་ལ་སེམས་ཀྱི་སྐད་ཅིག་ཐམས་ཅད་དུ་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཐམས་ཅད་ལས་ཡོངས་སུ་འདལ་བའི་ཡེ་ཤེས་ཀྱི་མིག་གིས་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་དེ།
en: “Noble one, in every moment of mind, with eyes of knowledge that encompass all atoms, I see and comprehend within all atoms in this world realm of Sahā an ocean of the buddha realms of the tathāgatas, which have appeared from the vast extent of the ocean of prayers made by the Bhagavat Vairocana.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཏུ་དེ་བཞིན་གཤེགས་པ་བྱུང་བ་རྒྱ་མཚོ་དག་ཀྱང་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་ལ་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་ཆེན་པོ་དག་ལ་ཡང་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་པ་དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་དང་སེམས་ཅན་རྣམ་པར་གདུལ་བའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བས།
en: I see and comprehend the ocean of the tathāgatas that are in those buddha realms. I also see and comprehend the great ocean of the miraculous manifestations at the bodhisattva births of those tathāgatas.

source: རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་ཐམས་ཅད་ལའང་།
en: “In the same way, in every instant of mind I see and comprehend the entire ocean of the miraculous manifestations of the supremacy of guiding beings and the ocean of the miraculous manifestations at the bodhisattva births of all tathāgatas in the ten directions.

source: སེམས་ཀྱི་སྐད་ཅིག་ཐམས་ཅད་དུ་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །ཇི་ལྟར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་འབྱམ་ཀླས་པ་ཐམས་ཅད་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལ་འཇུག་པས་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་མ་ནོར་བར་མངོན་དུ་གྱུར་ཏེ།
en: “I perceive without error the births of bodhisattvas through comprehending the succession of the entire vast extent of atoms in this world realm of a thousand million worlds, and I comprehend the qualities of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ལ་ཞུགས་པར་གྱུར་པ་དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་འབྱམ་ཀླས་པ་ཐམས་ཅད་ཀྱི་ཁོངས་སུ་ཆུད་པའི་ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་ལའང་འཇུག་སྟེ། དེ་དག་ཏུའང་སངས་རྒྱས་རྒྱ་མཚོ་ཤིན་ཏུ་ཡངས་པ་ལ་འཇུག་གོ །
en: In the same way, I comprehend the entire ocean of realms contained within the entire vast extent of the atoms in countless tens of thousands of quintillions of buddha realms in the ten directions, and I comprehend the vast ocean of buddhas within them.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བྱང་ཆུབ་སེམས་དཔར་གྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་འབྱུང་བའི་རྣམ་པར་འཕྲུལ་པ་རྣམས་ཀྱང་མངོན་དུ་གྱུར་པར་ལྟའོ། །
en: I also see the perception of the miraculous manifestations at the bodhisattva births of those buddha bhagavats.

source: དེ་བཞིན་གཤེགས་པར་གྱུར་ནས་ཀྱང་མཆོད་པ་བྱེད་དོ། །
en: I make offerings to them when they become tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ལས་ཀྱང་ཆོས་བསྟན་པ་ཉན་ཏོ། །
en: I hear the teachings that those tathāgatas give.

source: ཆོས་ལ་ཡང་གཉེར་བའི་ཆོས་ཀྱི་ནན་ཏན་དུ་བྱེད་དོ། །
en: I practice the correct Dharma of their Dharma.”

source: དེ་ནས་ལུམ་བི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་གྱིས་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསྐལ་པ་ཚད་མེད་པར་དམྱིགས་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བས་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་སྟོན་པ་འདི་གསལ་བར་བསྟན་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཕྱོགས་བཅུའི་རྣམ་པར་བལྟས་ཏེ། ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །རིམ་གྲོ་བསྐྱེད་ཅིང་ང་ལ་གང་འདྲི་བ། །དེ་དག་བདག་ལས་རྒྱལ་བའི་སྲས་ཉོན་ཅིག །
en: Then at that time, Sutejomaṇḍala­rati­śrī, the goddess of the Lumbinī Forest, in order to teach clearly the bodhisattva liberation called the miraculous manifestations at the birth of bodhisattvas throughout all the perceptions of countless kalpas, through the blessing of the Buddha, gazed into the ten directions and recited these verses: “Son of the jinas, you have shown respect And have asked a question, so listen to what I have to say.

source: རྒྱལ་བའི་སྤྱོད་ཡུལ་བལྟ་དཀའ་ཞི་བ་སྟེ། །རྒྱུ་དང་རྐྱེན་གྱི་ཚུལ་གྱིས་རྣམ་པར་བསྟན། །
en: The field of activity of the jinas is a peace that is hard to see And which is manifested through the ways of causes and conditions.

source: ཞིང་རྣམས་བྱེ་བའི་རྡུལ་ཕྲན་རབ་སྙེད་ཀྱི། །སྔོན་གྱི་བསྐལ་པ་བསམ་གྱིས་མྱི་ཁྱབ་དྲན། །བསྐལ་པའི་མིང་ནི་སྔ་ཕྱི་མཉམ་ཞེས་བྱ། །དེ་ལ་རྒྱལ་བ་བྱེ་བ་བརྒྱད་ཅུ་བྱུང་། །
en: {1} “I remember as many countless kalpas ago As there are atoms in ten million realms, There was a kalpa that had the name Samāpadyata, In which there were eight hundred million jinas.

source: བསྐལ་བའི་དང་པོར་དེ་བཞིན་གཤེགས་བྱུང་བ། །དབང་ཕྱུག་ཡོན་ཏན་མི་ཐུབ་རྒྱལ་མཚན་ནོ། །
en: {2} “The first of the kalpa’s tathāgatas to appear Was Īśvarājita­guṇa­dhvaja.

source: ནགས་ཚལ་དམ་པ་གསེར་མདོག་མེ་ཏོག་ཏུ། །མགོན་པོ་དེ་འཁྲུངས་དག་གིས་མཐོང་བར་གྱུར། །
en: I saw the birth of that lord of beings In the supreme forest Svarṇa­puṣpa­prabhava.

source: མྱིང་དུ་དྲི་མྱེད་སྐྱེད་པའི་འོད་ཅེས་བྱ། །དེ་ཡི་མ་མ་མཁས་པར་བདག་གྱུར་ཏེ། །
en: {3} “I was his wise nurse, Vimala­saṃbhava­prabhā.

source: བལྟམ་མ་ཐག་ཏུ་གསེར་མདོག་དམ་པའི་འོད། །འཇིག་རྟེན་དབང་པོས་བདག་གི་པང་དུ་བཞག །
en: As soon as he was born, there was a supreme golden light, And the lords of the world placed him on my lap.

source: གང་ཟག་དམ་པ་པང་དུ་བཞག་ཚེ་ཡང་། །དེ་ཡི་སྤྱི་གཙུག་བལྟ་བར་མི་ནུས་ཏེ། །
en: {4} “When the supreme individual was placed on my lap, I could not see the top of his inconceivable head.

source: བསམ་ཡས་དེ་ལ་གཡས་དང་གཡོན་དུ་ཡང་། །བལྟས་ཤིང་མཐའ་རྙེད་མཐོང་བར་མ་གྱུར་ཏོ། །
en: Though I looked from the right and the left, I was not able to see where it ended.

source: མཚན་རབ་བཟང་པོས་དེ་ནི་ཡོངས་སུ་བརྒྱན། །དྲི་མེད་དེ་སྐུ་བལྟ་ན་རབ་སྡུག་སྟེ། །
en: {5} “He was adorned with the excellent physical signs, And his body was stainless and beautiful.

source: རིན་ཆེན་གཟུགས་འདྲ་བདག་གིས་མཐོང་གྱུར་ནས། །དགའ་བའི་ཤུགས་དྲག་མཚུངས་མྱེད་རྣམ་པར་འཕེལ། །
en: He was as if made of jewels, and when I saw him An unparalleled powerful joy increased within me.

source: དེ་ཡི་ཡོན་ཏན་དཔག་ཡས་སེམས་སེམས་ནས། །ཁོ་མོའི་བསོད་ནམས་རྒྱ་མཚོ་དཔག་མེད་འཕེལ། །
en: {6} “As I contemplated his measureless qualities, The ocean of my merit increased.

source: དེ་ཡི་རྣམ་འཕྲུལ་རྒྱ་མཚོ་མཐོང་གྱུར་ནས། །རྒྱ་ཆེན་བྱང་ཆུབ་སེམས་ཀྱང་སྐྱེས་པར་གྱུར། །
en: When I saw the ocean of his miraculous manifestations, A vast aspiration for enlightenment arose within me.

source: རྒྱལ་བའི་ལེགས་པ་རྒྱ་མཚོ་དགའ་སྨོན་ནས། །སྨོན་ལམ་རྒྱ་མཚོ་བདག་གིས་རབ་ཏུ་བསྐྱེད། །
en: {7} “With joy and faith in the Jina’s ocean of excellences, I gave rise to an ocean of prayers.

source: འབྱམ་ཀླས་ཞིང་རྣམས་ཐམས་ཅད་རྣམ་པར་སྦྱངས། །ངན་སོང་ལམ་རྣམས་ཀུན་ཀྱང་རྣམ་པར་བཟློག །
en: The vast extent of all realms was purified, And all paths to lower existences were averted.

source: ཞིང་རྣམས་འབྱམ་ཀླས་ཀུན་གྱི་བདེ་གཤེགས་རྣམས། །མ་བྱོན་བསམ་གྱིས་མི་ཁྱབ་མཆོད་པ་དང་། །སེམས་ཅན་སྡུག་བསྔལ་རྣམ་པར་དགྲོལ་བའི་ཕྱིར། །སྨོན་ལམ་རྒྱ་མཚོ་ཁོ་མོས་བཏབ་པར་གྱུར། །
en: {8} “I made an ocean of prayers that I would make Countless offerings to future sugatas Throughout the vast extent of realms And liberate beings from suffering.

source: མགོན་པོ་དེ་ལས་བདག་གིས་ཆོས་ཐོས་ནས། །རྣམ་ཐར་དམ་པའི་དཀྱིལ་འཁོར་འདི་ཡང་ཐོབ། །
en: {9} “I heard the Dharma from that lord And attained the field of this liberation.

source: བསྐལ་པ་ཞིང་རྣམས་བྱེ་བའི་རྡུལ་སྙེད་དུ། །སྤྱད་པ་སྤྱད་དེ་དེ་ཡང་རྣམ་པར་སྦྱངས། །
en: For kalpas as numerous as atoms in ten million realms, I practiced and purified bodhisattva conduct.

source: དེ་ལ་མགོན་པོ་ཇི་སྙེད་བྱུང་གྱུར་པ། །དེ་དག་མ་ལུས་བདག་གིས་ཀུན་ཀྱང་མཆོད། །
en: {10} “I have made offerings to however many lords Have appeared without exception.

source: རྣམ་ཐར་རྒྱ་མཚོ་འདི་ནི་སྦྱོང་བྱེད་ཅིང་། །དེ་དག་བསྟན་པ་ཁོ་མོས་ཡོངས་སུ་བཟུང་། །
en: I became a holder of their teachings, And I purified the ocean of this liberation.

source: ཞིང་རྣམས་བྱེ་བའི་རྡུལ་ཕྲན་རབ་སྙེད་ཀྱི། །སྟོབས་བཅུ་མངའ་བ་ཇི་སྙེད་འདས་བྱུང་བ། །དེ་དག་ཆོས་ཀྱི་འཁོར་ལོ་ཁོ་མོས་བཟུང་། །རྣམ་ཐར་དཀྱིལ་འཁོར་འདི་ཡང་རབ་ཏུ་བསྒོམས། །
en: {11} “I became a holder of the Dharma wheel Of all the past possessors of the ten strengths, As numerous as the atoms in ten million realms, And I have meditated on the field of this liberation.

source: སངས་རྒྱས་ཞིང་གི་རྡུལ་ཕྲན་ཇི་སྙེད་པ། །རྡུལ་རྩེ་འབྱམ་ཀླས་ཀུན་ལ་རྣམ་པར་མཐོང་། །
en: {12} “I see all the vast extent of the surfaces of atoms, As many atoms as there are in the buddha realms.

source: རྡུལ་ཕྲན་རེ་རེ་ལ་ཡང་རྒྱ་མཚོའི་ཞིང་། །སྔོན་ཆད་རྒྱལ་བས་སྦྱངས་པ་རབ་ཏུ་མཐོང་། །ཞིང་རྣམས་འབྱམ་ཀླས་དེ་དག་ཀུན་ཏུ་ཡང་། །
en: In each atom I see the ocean of realms That have been purified in the past by the jinas.

source: མགོན་པོ་ཐུགས་རྒྱུད་གཅིག་ལ་བསམ་ཡས་པའི། །རྣམ་འཕྲུལ་ཡངས་པ་ཡོངས་སུ་སྟོན་མཛད་ཅིང་། །ནགས་ཚལ་མཆོག་ཏུ་འཁྲུངས་གྱུར་བདག་གིས་མཐོང་། །རྒྱལ་བ་ལ་ལ་ཞིང་རྣམས་ལ་ལ་ན། །བྱང་ཆུབ་དམ་པར་འཚང་རྒྱ་ཐུགས་དགོངས་ཤིང་། །
en: {13} “In all that vast extent of realms, The lords from their one mind Manifest countless miracles, And I see their births in supreme forests.

source: དགའ་ལྡན་འཇིག་རྟེན་ཉིད་ན་བཞུགས་པ་ཡང་། །ཞིང་རྣམས་བྱེ་བ་བསམ་གྱིས་མི་ཁྱབ་པ། །ཞིང་རྣམས་རྒྱ་མཚོའི་དབྱིངས་སུ་རྣམ་འཕྲུལ་པ། །
en: {14} “There are certain jinas in certain realms Intending to attain supreme enlightenment, Who though they are residing in the world of Tuṣita Manifest within an ocean of realms.

source: ཤིན་ཏུ་ཡངས་པ་སྐྱེ་བའང་བདག་གིས་མཐོང་། །
en: {15} “In countless tens of millions of realms, I see this vast extent of their births.

source: ན་ཆུང་དམ་པའི་ཚོགས་ཀྱི་དབུས་བཞུགས་ཤིང་། །མགོན་པོ་ཆོས་རྣམས་སྟོན་པའངདེ་བཞིན་མཐོང་། །
en: I see the lords teaching the Dharma While in the center of an assembly of youths.

source: ཞིང་རྣམས་བྱེ་བའི་རྡུལ་ཕྲན་རབ་སྙེད་ཀྱི། །དཔའ་བོ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ། །མངོན་པར་འབྱུང་ཞིང་ཤིང་རྒྱལ་དྲུང་གཤེགས་དང་། །སངས་རྒྱས་སྤྱོད་ཡུལ་ཡངས་པ་སྟོན་པ་མཐོང་། །
en: {16} “I see in each instant of mind those heroes Who are as numerous as the atoms in ten million realms Leaving home and going to the foot of the king of trees And manifesting the vast field of activity of a buddha.

source: ཞིང་གཅིག་རྡུལ་ལ་བསམ་གྱིས་མི་ཁྱབ་པར། །ཡུལ་རྣམས་གཞན་དང་གཞན་དག་སྟོན་མཛད་པས། །
en: {17} “They manifest inconceivable numbers of this and that realm, Which are as numerous as the atoms in a realm.

source: འགྲོ་རྒྱུད་སེམས་ཅན་སྡུག་བསྔལ་སྒྲོལ་མཛད་ཅིང་། །མི་གཙོ་རྣམ་པར་འཚང་རྒྱ་བདག་གིས་མཐོང་། །
en: I see the supreme humans attaining buddhahood And liberating beings in various existences from suffering.

source: རྡུལ་ཕྲན་རེ་རེའི་རྩེ་ལ་མི་ཟད་པའི། །རང་འབྱུང་འཁོར་ལོ་རབ་ཏུ་བསྐོར་མཛད་ཅིང་། །
en: “They turn the unceasing, self-originated, Supreme wheel of the surface of each atom.

source: དབྱངས་རྣམས་རྒྱ་མཚོ་མི་ཟད་སྒྲོག་མཛད་པ། །
en: Their voices have an unceasing ocean of speech.

source: ཆོས་སྤྲིན་རྒྱ་ཆེན་ཆར་འབེབས་མཛད་པ་མཐོང་། །
en: I see them sending down rain from clouds of Dharma.

source: འགྲོ་བ་ཀུན་ལ་རྣམ་པ་དུ་མར་ཡང་། །སྐད་ཅིག་རེ་རེར་མྱ་ངན་འདས་སྟོན་པ། །
en: “In each instant they manifest passing into nirvāṇa In many different forms for all beings.

source: ཞིང་རྣམས་བྱེ་བའི་རྡུལ་ཕྲན་རབ་སྙེད་ཀྱི། །སངས་རྒྱས་ཞིང་གཅིག་རྡུལ་ལས་བདག་གིས་མཐོང་། །
en: I see, in a single atom of a realm, buddhas As numerous as the atoms in ten million realms.

source: རྡུལ་གཅིག་བལྟས་ཀྱང་ཞིང་རྣམས་རྒྱ་མཚོ་དང་། །རྒྱལ་བ་འབྱུང་བ་ཇི་སྙེད་ཀུན་ཀྱང་མཐོང་། །
en: “Looking at one atom, I see an ocean of realms And all the jinas who appear in them.

source: ཚེ་རབས་ཀུན་ཏུ་ལུས་མང་ཁྲག་ཁྲིག་གིས། །དེ་དག་མཆོད་པའི་དོན་དུ་ཉེ་བར་ཕྱིན། །
en: In many hundred billion bodies in my lifetimes, I have gone to make offerings to them.

source: ཞིང་ཚུལ་རྒྱ་མཚོ་བསམ་གྱིས་མི་ཁྱབ་པའི། །འགྲོ་རྒྱུད་མི་ཟད་ཇི་སྙེད་ཡོད་པ་ཡི། །
en: {18} “There are all the endless existences of beings In the inconceivable ways of the ocean of realms.

source: འགྲོ་བ་ཀུན་ལ་མངོན་དུ་ཁོ་མོ་ནི། །ཆོས་སྤྲིན་ཡངས་པའི་ཆར་ཡང་རབ་ཏུ་འབེབས། །
en: I come before them all and send down A rain from the vast clouds of the Dharma.

source: རྒྱལ་སྲས་ཁོ་མོས་བསམ་གྱིས་མི་ཁྱབ་པའི། །རྣམ་ཐར་དཀྱིལ་འཁོར་དམ་པ་འདི་ཤེས་ཀྱི། །བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བསམ་ཡས་སུ། །
en: {19} “Son of the jinas, I know this inconceivable Supreme field of liberation, But I could not teach it all In countless quintillions of kalpas.

source: ཐམས་ཅད་བསྟན་པ་ཁོ་མོས་ནུས་རེ་སྐན། །རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསྐལ་པ་ཚད་མེད་པར་དམྱིགས་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བས་རྣམ་པར་འཕྲུལ་བ་ཡོངས་སུ་སྟོན་པ་འདི་ཤེས་པར་ཟད་ན། ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་བསྐལ་པ་ཐམས་ཅད་དུ་ཞུགས་པའི་མངལ་ནས་ཡོངས་སུ་བྱུང་བའི་སེམས་དང་ལྡན་པ།
en: {20} “Noble one, I know only this bodhisattva liberation called the miraculous manifestations at the birth of bodhisattvas throughout all the perceptions of countless kalpas.

source: ཆོས་ཀྱི་ཚུལ་ཐམས་ཅད་ངེས་པར་རྟོགས་པའི་སྐྱེ་བ་རབ་ཏུ་སྟོན་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཆོད་པའི་སྨོན་ལམ་གྱིས་བསམ་པ་ཡོངས་སུ་བསྐྱེད་པ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བ་ལ་རབ་ཏུ་གཞོལ་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་རིགས་དང་རྒྱུད་ཀྱི་ལམ་ཡོངས་སུ་བསྟན་པ་ལ་གཟུགས་བརྙན་ལྟ་བུར་གྱུར་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་དུ་པདྨོའི་ནང་ནས་སྐྱེ་བ་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་དུས་ལ་མཁས་པ། སེམས་ཅན་ཐམས་ཅད་གདུལ་བ་ལ་མངོན་པར་མོས་ཤིང་ཚེར་སྐྱེ་བས་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་སྟོན་པ། ཞིང་འབྱམ་ཀླས་པ་ཐམས་ཅད་དུ་རྣམ་པར་འཕྲུལ་པའི་སྤྲིན་ཡོངས་སུ་སྟོན་པ། འགྲོ་བ་ཐམས་ཅད་ཀྱི་ལམ་གྱི་རྒྱུད་དུ་སྐྱེ་བ་དང་།
en: How could I describe the qualities or know the conduct of bodhisattvas who in each instant of mind have the motivation to appear in all kalpas from the wombs they have entered; who manifest births that have the definitive understanding of all the ways of the Dharma; who have the aspiration that gives rise to prayers to make offerings to all the tathāgatas; who are dedicated to attaining the complete realization of all the Dharma of the buddhas; who manifest like reflections within the classes and existences of all beings; who are born from lotuses at the feet of all the tathāgatas; who are skilled in knowing when the time has come to ripen all beings; who manifest the miracle of taking rebirth with the intention to guide all beings; who manifest clouds of miracles throughout the entire vast extent of realms; and who appear as reflections in all the classes of births and existences of all beings?

source: རིགས་སུ་གཟུགས་བརྙན་བྱུང་བར་གྱུར་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་འདི་ན་ཤཱཀྱའི་བུ་མོ་གོ་བ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ།
en: In the great city of Kapilavastu there is the Śākya maiden called Gopā.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་ཕྱིར། འཁོར་བ་ན་འཁོར་བར་བྱ་བ་དྲིས་ཤིག །
en: Go to her and ask her, ‘How should a bodhisattva continue in saṃsāra in order to ripen beings?’ ”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ལུམ་བི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་གྱི་རྐང་བ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལུམ་བི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། །ལུམ་བི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་གྱི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་བཅུ་བཞི་བ། །
en: Sudhana, the head merchant’s son, bowed his head to the two feet of Sutejomaṇḍala­rati­śrī, the Lumbinī Forest goddess, circumambulated Sutejomaṇḍala­rati­śrī, the Lumbinī Forest goddess, many hundreds of thousands of times, keeping her to his right, and, with palms together, looking back at her, departed from Sutejomaṇḍala­rati­śrī, the Lumbinī Forest goddess.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལུམ་བི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་གྱི་དྲུང་ནས་སོང་སྟེ། གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་གང་ན་བ་དེར་ཕྱིན་ནས། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསྐལ་པ་ཚད་མེད་པར་དམྱིགས་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བས་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་སྟོན་པ་དེ་ཉིད་བསྒོམ་པ་དང་། ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། རྒྱ་ཆེར་བྱ་བ་དང་། ནན་ཏན་དུ་བྱ་བ་དང་།
en: Gopā Chapter 43 Sudhana, the head merchant’s son, left the presence of Sutejomaṇḍala­rati­śrī, the Lumbinī Forest goddess, and went to the location of the great city of Kapilavastu.

source: ཤིན་ཏུ་སྦྱང་བ་དང་། ཡོངས་སུ་བསམ་པ་དང་། རྣམ་པར་དབྱེ་བ་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་འགྲོ་བའི་ཁང་བ་ཆོས་ཀྱི་དབྱིངས་རབ་ཏུ་སྣང་བའི་འོད་གང་ན་བ་དེར་སོང་ངོ་། །
en: While meditating on, comprehending, increasing, practicing, purifying, contemplating, and examining the bodhisattva liberation called the miraculous manifestations at the birth of bodhisattvas throughout all the perceptions of countless kalpas, he came to the assembly hall of the bodhisattvas called the Illuminating Light of the Realm of the Dharma.

source: དེར་འགྲོ་བའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་བགྲོ་བའི་ཁང་པའི་ལྷ་མོ་མྱ་ངན་མྱེད་པའི་དཔལ་ཞེས་བྱ་བ་དེ་ལ་ཁྱིམ་གྱི་ལྷ་མོ་སྟོང་ཕྲག་བཅུ་དང་བཅས་བསུ་ནས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །སྐྱེས་བུ་ཆེན་པོ་ཤེས་རབ་དང་། ཡེ་ཤེས་ཆེན་པོས་རྣམ་པར་གནོན་པ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་བསམ་གྱིས་མྱི་ཁྱབ་པ་སྒོམ་པ་ལ་ལྷག་པར་དམྱིགས་པའི་སྨོན་ལམ་གྱི་སེམས་དང་ལྡན་པ། ཆོས་ཡངས་པའི་གཞལ་མེད་ཁང་གི་སྤྱོད་ཡུལ་ལ་སྤྱོད་པ། ཆོས་ཀྱི་གྲོང་ཁྱེར་དུ་མངོན་པར་གཞོལ་བ། བྱང་ཆུབ་སེམས་དཔའི་ཐབས་ཀྱི་ཚུལ་མཐའ་ཡས་པས་སེམས་ཅན་འདུལ་བ་ལ་འཇུག་པ་རྒྱུན་མི་གཅོད་པ།
en: When he arrived there, he was greeted by Aśokaśrī, the goddess of the assembly hall of the bodhisattvas, together with ten thousand house goddesses.

source: དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་རྒྱ་མཚོ་སྣང་བ་རབ་ཏུ་ཐོབ་པ། འགྲོ་བ་ཐམས་ཅད་རྣམ་པར་གདུལ་པ་ལ་རབ་ཏུ་སྣང་བའི་སྤོབས་པ་དང་། ཡེ་ཤེས་མངོན་དུ་གྱུར་བ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ཤེས་པའི་ལུས་ཀྱིས་འགྲོ་ཞིང་རྗེས་སུ་འབྲང་བར་བྱ་བའི་སྤྱོད་པ་ལ་མངོན་དུ་གྱུར་པའི་སེམས་དང་ལྡན་པ། འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་དགའ་བ་རྒྱ་མཚོའི་ཤུགས་རྣམ་པར་འཕེལ་བར་བྱ་བའི་སྨོན་ལམ་དང་ལྡན་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ལམ་དུ་ཞུགས་པ། ཁྱོད་བྱོན་པ་ལེགས་སོ། །མིག་ཕྱིར་གླན་པ་མྱེད་པས་སྤྱོད་པ་དང་།
en: She said to Sudhana, the head merchant’s son, “We welcome you, great being who has the prowess of great wisdom and knowledge; whose mind has attained the meditation of inconceivable bodhisattva liberation; whose field of activity is the vast divine palace of the Dharma; who enters the city of the Dharma; who is continuously engaged in guiding beings through infinite bodhisattva methods; who has attained the illumination of the ocean of qualities of the tathāgatas; who has the manifest knowledge and illuminating eloquence for guiding all beings; who has the motivation to manifest the conduct of a corresponding body and language that knows the conduct of all beings; who prays to increase the power of an ocean of joy in the minds of all beings; and who follows the path to the comprehension of the Dharma of all the tathāgatas.

source: སྤྱོད་ལམ་ཟབ་ཅིང་རྣམ་པར་དག་པའི་སྤྱོད་ཡུལ་ཅན་ཁྱོད་ལ་བལྟས་ན། ཁྱོད་ནི་རིང་པོ་མྱི་ཐོགས་པར་དེ་བཞིན་གཤེགས་པའི་སྐུ་དང་། གསུང་དང་། ཐུགས་ཀྱི་རྒྱན་རྣམ་པར་དག་པ་བླ་ན་མྱེད་པ་རབ་ཏུ་ཐོབ་སྟེ། མཚན་དང་དཔེ་བྱད་བཟང་པོས་རབ་ཏུ་བརྒྱན་པའི་ལུས་དང་སྟོབས་བཅུའི་ཡེ་ཤེས་སྣང་བས་བརྒྱན་པའི་སེམས་ཀྱིས་འཇིག་རྟེན་དུ་རྣམ་པར་སྤྱོད་པར་འགྱུར་རོ། །ཁྱོད་ཀྱི་བརྩོན་འགྲུས་དང་རྣམ་པར་གནོན་པ་ལ་བལྟས་ན། ཁྱོད་ནི་རིང་པོ་མི་ཐོགས་པར་དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་མངོན་དུ་གྱུར་བར་མཐོང་བ་དང་ལྡན་ཞིང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་དང་།
en: “I see that you have the field of activity of profound behavior with a steady gaze, and that therefore you are someone who will soon attain the unsurpassable pure adornments of the body, speech, and mind of the tathāgatas and will act in this world with a body adorned by the signs and features of a great being and with a mind adorned by the light of knowledge of the ten strengths.

source: བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་དང་། རྣམ་པར་ཐར་བ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་ཆོས་ཞི་བ་དང་ལྡན་པའི་གཞལ་མེད་ཁང་གི་དགའ་བ་མྱོང་བ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་ཐར་པ་ཟབ་མོར་ཆུད་པར་འགྱུར་རོ། །
en: “I see that you have diligence and prowess, and that therefore you are someone who soon will have the vision of the tathāgatas of the three times; will hold the clouds of Dharmas of all the tathāgatas; will experience the joy of the divine palace of the four qualities of bodhisattva dhyānas, liberations, samādhis, and samāpattis; and will enter the profound liberation of the buddhas.
